# ServiceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..ServiceType Property
Zone Class See Also
---
Get or set the Service Type of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ServiceType ServiceType { get; set; }
```

Visual Basic
---
```text
Public Property ServiceType As ServiceType
	Get
	Set
```

Visual C++
---
```text
public:
property ServiceType ServiceType {
	ServiceType get ();
	void set (ServiceType value);
}
```

# Remarks
This property is used to get or set the Service Type of the Zone.
# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace